UKS/src/Catalogs/ШаблоныПечатныхФорм/ШаблоныПечатныхФорм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныПечатныхФорм</name>
  <comment>Внешние шаблоны печатных форм</comment>
  <attributes>
    <name>ОбъектМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыКоманды</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата создания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <comment>Расширени файла</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

UKS/src/Catalogs/ШаблоныПечатныхФорм/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПослеПомещенияФайла(Результат,Адрес,ВыбранноеИмяФайла,ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;
	
	АдресФайлаВХранилище = Адрес;
	ШаблонФайла = ВыбранноеИмяФайла;
	ЗагружаемыйФайл = Новый Файл(ВыбранноеИмяФайла);
	Объект.РасширениеФайла = Сред(ЗагружаемыйФайл.Расширение,2,СтрДлина(ЗагружаемыйФайл.Расширение)-1);
	Объект.ДатаСоздания = ЗагружаемыйФайл.ПолучитьУниверсальноеВремяИзменения();
	Объект.РазмерФайла = ЗагружаемыйФайл.Размер();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиФайла(ВыбранныйФайл,ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйФайл=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Расширение",);
	ДополнительныеПараметры.Вставить("ДатаСоздания",);
	ДополнительныеПараметры.Вставить("РазмерФайла",);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПомещенияФайла",ЭтаФорма,ДополнительныеПараметры);
	НачатьПомещениеФайла(ОписаниеОповещения,,ВыбранныйФайл[0],Ложь,УникальныйИдентификатор); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлШаблон(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытия.МножественныйВыбор = Ложь;
	ДиалогОткрытия.Фильтр = "Файл шаблона MS-Word (*.doc)|*.doc*";
	ОписаниеОповещенияПослеЗагрузкиФайла = Новый ОписаниеОповещения("ПослеЗагрузкиФайла",ЭтаФорма);
	ДиалогОткрытия.Показать(ОписаниеОповещенияПослеЗагрузкиФайла);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресФайлаВХранилище) Тогда
		ТекущийОбъект.Шаблон = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФайлаВХранилище));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Документ Из Метаданные.Документы Цикл
		Элементы.ОбъектМетаданных.СписокВыбора.Добавить(Документ.ПолноеИмя());
	КонецЦикла;
	
КонецПроцедуры
